tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/refined/case/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 293.15;

boundaryField
{
    waterInlet   { type fixedValue; value uniform 293.15; }
    waterOutlet  { type inletOutlet; inletValue uniform 293.15; value uniform 293.15; }
    airInlet     { type zeroGradient; }
    ambientFloor { type inletOutlet; inletValue uniform 293.15; value uniform 293.15; }
    ambientSides { type inletOutlet; inletValue uniform 293.15; value uniform 293.15; }
    ambientTop   { type inletOutlet; inletValue uniform 293.15; value uniform 293.15; }
    walls        { type zeroGradient; }
    frontAndBack { type empty; }
}

