tests/test_04_mahywansi2024/cases/S1_JHR2024_continuous_air_validation/openfoam/2d/mesh_levels/refined/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    waterInlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    waterOutlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    airInlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ambientFloor
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    ambientSides
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    ambientTop
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    walls
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
